package com.template.data

enum class QuestionAndAnswerBase(
    val rightAnswer: String,
    val wrong1Answer: String,
    val wrong2Answer: String,
    val wrong3Answer: String,
) {

    ЗАМЕНИТЬ_ВОПРОС_1(
        "ПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ"),

    ЗАМЕНИТЬ_ВОПРОС_2 (
        "ПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ"),

    ЗАМЕНИТЬ_ВОПРОС_3(
        "ПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ"),

    ЗАМЕНИТЬ_ВОПРОС_4 (
        "ПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ"),

    ЗАМЕНИТЬ_ВОПРОС_5 (
        "ПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ"),

    ЗАМЕНИТЬ_ВОПРОС_6 (
        "ПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ"),

    ЗАМЕНИТЬ_ВОПРОС_7 (
        "ПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ"),

    ЗАМЕНИТЬ_ВОПРОС_8 (
        "ПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ"),

    ЗАМЕНИТЬ_ВОПРОС_9 (
        "ПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ"),

    ЗАМЕНИТЬ_ВОПРОС_10 (
        "ПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ",
        "НЕПРАВИЛЬНЫЙ_ОТВЕТ")
}